{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 1], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"output_shape_type": "raw", "trainable": true, "name": "lambda_1", "dtype": "float32", "arguments": {}, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>K\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 1], "output_shape": null}, "class_name": "Lambda", "name": "lambda_1"}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "filters": 2, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1", "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"activation": "elu", "trainable": true, "name": "elu_conv1"}, "class_name": "Activation", "name": "elu_conv1"}, {"inbound_nodes": [[["elu_conv1", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "pool1", "padding": "valid", "pool_size": [3, 3]}, "class_name": "MaxPooling2D", "name": "pool1"}, {"inbound_nodes": [[["pool1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "filters": 1, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "fire2/squeeze1x1", "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "fire2/squeeze1x1"}, {"inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "config": {"activation": "elu", "trainable": true, "name": "fire2/elu_squeeze1x1"}, "class_name": "Activation", "name": "fire2/elu_squeeze1x1"}, {"inbound_nodes": [[["fire2/elu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "filters": 2, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "fire2/expand1x1", "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "fire2/expand1x1"}, {"inbound_nodes": [[["fire2/elu_squeeze1x1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "filters": 2, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "fire2/expand3x3", "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "fire2/expand3x3"}, {"inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "config": {"activation": "elu", "trainable": true, "name": "fire2/elu_expand1x1"}, "class_name": "Activation", "name": "fire2/elu_expand1x1"}, {"inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "config": {"activation": "elu", "trainable": true, "name": "fire2/elu_expand3x3"}, "class_name": "Activation", "name": "fire2/elu_expand3x3"}, {"inbound_nodes": [[["fire2/elu_expand1x1", 0, 0, {}], ["fire2/elu_expand3x3", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "fire2/concat"}, "class_name": "Concatenate", "name": "fire2/concat"}, {"inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "drop3"}, "class_name": "Dropout", "name": "drop3"}, {"inbound_nodes": [[["drop3", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}, "class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1"}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "loss", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense", "name": "loss"}], "output_layers": [["loss", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.8"}